#+author: ligy
#+email: li.gaoyang@foxmail.com
#+date: <2020-04-07 Tue>

udacity的核心课程：数据挖掘工程师直通班，纳米学位。目标：在3到7天的时间里，完成所有数据挖掘课程，
同时还要进行项目练习。用了三天时间看了课程（的绝大多数），第四天先进行总结与整体梳理，
之后再进行项目练习。

** Python包概述
包是函数和类等的集合，数据分析最常用动的有Numpy, pandas, matplotlib
#+BEGIN_SRC python :results output
import numpy as np
l = list(range(9))
print(np.mean(l))
#+END_SRC

#+RESULTS:
: 4.0
*** 树结构
被包含就是子结构，如 ~h1~ ~p~ 是 ~div~ 的子结构。
#+BEGIN_SRC html
<body>
<div>
<h1>this is heading1</h1>
<p>This is a paragraph</p>
<h2>this is heading1</h2>
</div>
<body>
#+END_SRC
一个有用的小技巧：
#+BEGIN_SRC python :results output
s = 'this is a random string to test a little trick.'
print(s[:-len('trick.')]) # 去掉末尾的字符串
#+END_SRC

#+RESULTS:
: this is a random string to test a little
*** 用编程的方式下载网络上的文件（http协议+Python Requests）
HTTP全称为超文本传输协议，是web浏览器和Web服务器之间的沟通语言。
#+BEGIN_SRC python :results output
import requests
import os
folder_name = 'ebert_reviews'
if not os.path.exists(folder_name):
    os.makedirs(folder_name)
url = 'https://classroom.udacity.com/nanodegrees/nd002-cn-advanced-vip/parts/4ec06ac9-9e53-42c2-a53d-3b4ec9d7e25e/modules/fea8de18-62f3-4b23-9f19-4293ee51871f/lessons/96402d84-c99d-4982-9edf-2430ef30d222/concepts/ed908f34-ce67-44c0-acb1-d81abd5d9e37'
response = requests.get(url)
with open(os.path.join(folder_name, 'down_html.txt'), 'wb') as f:
    f.write(response.content)
print(response) # 200代表请求成功

#+END_SRC

#+RESULTS:
: <Response [200]>
** 深度学习工具Pytorch
PyTorch 于 2017 年初推出，给深度学习社区带来了深远的影响。它是由 Facebook AI
研发团队开发的，已经被各行各业和各个学术领域采用。

张量，它是 PyTorch 的主要数据结构。我将演示如何创建张量、如何完成简单的运算，以及张量如何与
Numpy 交互。

然后，你将学习模块 Autograd，PyTorch 会使用该模块计算在训练神经网络过程中用到的梯度。
Autograd 非常强大。你可以用它完成整个反向传播工作：计算网络中每个运算的梯度，
然后使用这些梯度更新网络权重。

接着，你将使用 PyTorch 构建网络并使数据前向经过网络。然后，你将定义损失和优化方法，
并用手写数字数据集训练神经网络。你还将学习通过验证步骤测试网络的泛化能力。

然而，一个潜在问题是网络在处理复杂图像方面的效果不太好。
所以我们会接着学习如何使用预训练的网络改善分类器的效果，这种技巧称为迁移学习。

#+BEGIN_SRC python :results output
import torch
torch.manual_seed(7)
x = torch.randn((1, 5))
w = torch.randn_like(x)
b = torch.randn(1,1)
#b = 3
print('x: ', x)
print('x: ', x.view(5,1))
print('w: ', w)
print('torch.exp(x): ', torch.exp(-x))
print('torch.mm(w, x.view(5, 1)): ', torch.mm(w, x.view(5, 1)) + b)
#+END_SRC

#+RESULTS:
: x:  tensor([[-0.1468,  0.7861,  0.9468, -1.1143,  1.6908]])
: x:  tensor([[-0.1468],
:         [ 0.7861],
:         [ 0.9468],
:         [-1.1143],
:         [ 1.6908]])
: w:  tensor([[-0.8948, -0.3556,  1.2324,  0.1382, -1.6822]])
: torch.exp(x):  tensor([[1.1581, 0.4556, 0.3880, 3.0476, 0.1844]])
: torch.mm(w, x.view(5, 1)):  tensor([[1.0204]])

*** 用Pytorch搭建神经网络
#+BEGIN_SRC python :results output
import torch
import numpy as np
a = torch.randn(1, 3, 1, 1, 3)
print(a.shape)
# 压缩掉长度为1的维度，axis指定维度，从0开始。非1的维度，不产生任何效果
b = np.squeeze(a, axis = 0)
print(b.shape)
c = np.squeeze(a, axis = 3)
print(c.shape)
#+END_SRC

#+RESULTS:
: torch.Size([1, 3, 1, 1, 3])
: torch.Size([3, 1, 1, 3])
: torch.Size([1, 3, 1, 3])

注意 ~torch.nn.ReLU~ 和 ~torch.nn.funcional.relu~ 的区别：
- 前者是模块Module，可以放在 ~torch.nn.Sequential()~ 中
- 后者是函数，不能放入Sequential, 必须有参数传入

*小结：*
- 可以用 ~np.dot(features, weights) + b1~ 来构建网络
- 可以用pytorch的class，定义forward函数
- 可以用pytorch.nn.Sequential
- dim=0将每列求和，dim=1将每行求和
- 卷积操作时，图像维度变化 (W-F+2P)/S + 1
- ~transforms.RandomHorizontalFlip()~ 要放在totenosr之前！
